app/controllers/applications_controller.rb

  def index
    @applications = Application.all
---
SELECT "applications".* FROM "applications"

  def show
    @application = Application.find(params[:id])
---
SELECT "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @application = Application.find(params[:id])
---
SELECT "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @application = Application.new(params[:application])

    respond_to do |format|
      if @application.save
---
INSERT INTO "applications" ("created_at", "job_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 13 Feb 2012 22:32:20 UTC +00:00], ["job_id", 1], ["updated_at", Mon, 13 Feb 2012 22:32:20 UTC +00:00], ["user_id", 1]]