app/controllers/authentications_controller.rb

  def create
    auth = request.env["omniauth.auth"]

    # Try to find authentication first
    authentication = Authentication.find_by_provider_and_uid(auth['provider'], auth['uid'])

    if authentication
      # Authentication found, sign the user in.
      flash[:notice] = "Welcome back, #{authentication.user.first_name}"
      sign_in_and_redirect(:user, authentication.user)
    else
      # Authentication not found, thus a new user.
      test_user = User.new
      test_user.apply_omniauth(auth)
      # See if they got another form of invitation
      user = User.find_by_email( test_user.email )
      #if so use the invitation up
      if user && user.invitation_token
        user = User.accept_invitation!( :invitation_token => user.invitation_token, :name => test_user.name, :location => test_user.location )
        user.apply_omniauth(auth)
      #else just use the same user, and attach the authentication
      else
        user = test_user
      end
      if user.save(:validate => false)
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."uid" = '506852468' AND "authentications"."provider" = 'facebook' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
INSERT INTO "authentications" ("created_at", "provider", "token", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "location", "name", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "stars", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
UPDATE "users" SET "last_sign_in_at" = '2012-02-18 05:10:55.962341', "last_sign_in_ip" = '127.0.0.1', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 1, "current_sign_in_at" = '2012-02-18 05:10:55.962341', "updated_at" = '2012-02-18 05:10:55.962862' WHERE "users"."id" = 10