app/controllers/jobs_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1
---
  def new
    @job = Job.new
    @job.time = Time.zone.now().advance(:hours => 1,:days => 1)
    @job_types = JobType.all
    @job.user = current_user

    Rails.logger.info("------NEW JOB, creating from defaults..")
    #set type to default
    unless params[ :job_type_id ].nil?
      @job.job_type = JobType.find( params[ :job_type_id ] )