app/controllers/users_controller.rb

  def dashboard
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "10"]]

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "location", "name", "stars", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"